система_реагирования_на_ЧС/src/BusinessProcesses/ОповещениеСпасателей/ОповещениеСпасателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ОповещениеСпасателей</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаСбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГотовыеСпасатели</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Подтвердил</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВТочкеСбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

система_реагирования_на_ЧС/src/InformationRegisters/РегистрАдресации/РегистрАдресации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрАдресации</name>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

система_реагирования_на_ЧС/src/BusinessProcesses/ОповещениеСпасателей/ObjectModule.bsl
Процедура Действие1ПередСозданиемЗадач(ТочкаМаршрута, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Для Каждого Спасатель из ГотовыеСпасатели Цикл

		Если (Спасатель.Подтвердил) Тогда
			НоваяЗадача=Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
			НоваяЗадача.Задание="Явиться в точку сбора" + ТочкаСбора;
			НоваяЗадача.Наименование="Сбор";
			НоваяЗадача.Дата=Дата;
			НоваяЗадача.Исполнитель=Спасатель.Имя;
			НоваяЗадача.БизнесПроцесс=Ссылка;
			НоваяЗадача.ТочкаМаршрута=БизнесПроцессы.ОповещениеСпасателей.ТочкиМаршрута.Действие1;
			ФормируемыеЗадачи.Добавить(НоваяЗадача);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура ДействиеПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Наименование="Оповещение";
		Задача.Задание="Подтвердить возможность участия";
		Сообщить(Задача.ТочкаМаршрута);
	КонецЦикла;
КонецПроцедуры



Процедура СтартПередСтартом(ТочкаМаршрута, Отказ)
	Выборка=РегистрыСведений.РегистрАдресации.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если (Выборка.РольИсполнителя=Справочники.РолиПользователей.СпасательМЧС) Тогда
			Объект=ГотовыеСпасатели.Добавить();
			Объект.Имя=Выборка.Исполнитель;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
